const ap = new APlayer({
    container: document.getElementById('aplayer'),
    fixed: true,
    autoplay: false,
    lrcType: 1,
    audio: [
      {
        name: "我的将军啊（新版）",
        artist: '曲肖冰、半阳',
        url: 'http://www.ytmp3.cn/down/54273.mp3',
        cover: 'https://i.loli.net/2019/10/14/wZS7INh1knyQTvq.jpg',
        lrc: '[00:00.01]半阳、曲肖冰 - 我的将军啊(新版)\n[00:00.98]作词：半阳\n[00:01.18]作曲：半阳\n[00:01.33]编曲：Fsy小诺\n[00:01.53]录音：浔浔\n[00:01.68]混音：Mr鱼\n[00:01.83]制作人：梁安斌\n[00:02.08]监制：莫凝\n[00:06.82]狼烟风沙口\n[00:09.74]还请将军少饮酒\n[00:12.96]前方的路不好走\n[00:16.09]我在家中来等候\n[00:19.27]可愿柳下走\n[00:22.55]满头杨花共白首\n[00:25.72]十两相思二两酒\n[00:28.90]我才把爱说出口\n[00:32.12]狼烟风沙口\n[00:35.34]还请将军少饮酒\n[00:38.53]前方的路不好走\n[00:41.80]我在家中来等候\n[00:45.03]可愿柳下走\n[00:48.44]满头杨花共白首\n[00:51.32]十两相思二两酒\n[00:54.55]我才把爱说出口\n[00:59.61]有一座城楼上站一个将\n[01:05.81]远远望关隘口涂十里红妆\n[01:11.78]锣鼓中那位娇娘\n[01:15.32]哭泣给将军唱\n[01:18.19]将军说回去吧\n[01:21.21]这一去便是殉葬\n[01:25.10]冬雪一座破屋听见谁哭\n[01:31.34]寒夜风呼几许能盼来我夫\n[01:37.43]六月雪总是凄惨\n[01:40.71]痴情人不敢哭喊\n[01:44.15]深夜不断辗转\n[01:47.03]心上人早已走远\n[01:50.56]百年后谁埋入黄沙\n[01:56.99]碑文下栽种红花\n[02:03.27]只一朵名叫将军啊\n[02:09.80]又唤做彼岸是家\n[02:16.19]狼烟风沙口\n[02:19.26]还请将军少饮酒\n[02:22.54]前方的路不好走\n[02:25.72]我在家中来等候\n[02:28.95]可愿柳下走\n[02:32.08]满头杨花共白首\n[02:35.25]十两相思二两酒\n[02:38.54]我才把爱说出口\n[02:43.38]百年后谁埋入黄沙\n[02:49.88]碑文下栽种红花\n[02:56.09]只一朵名叫将军啊\n[03:02.58]又唤做彼岸是家\n[03:09.06]狼烟风沙口\n[03:12.13]还请将军少饮酒\n[03:15.31]前方的路不好走\n[03:18.54]我在家中来等候\n[03:21.72]可愿柳下走\n[03:24.90]满头杨花共白首\n[03:28.13]十两相思二两酒\n[03:31.31]我才把爱说出口\n'
      },
    ]
});